Revit 2027 API
BuiltInFailures.LinkFailures.ModifyingLinkedFile Property
 Shared Locations in the Linked Model '[Name]' have been modified, but not saved back to the Linked File. Upon reopening, instances of the Linked Model will return to their last Saved Positions. You can Save the Linked Model later via the Manage Links dialog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ModifyingLinkedFile { get; }
Public Shared ReadOnly Property ModifyingLinkedFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ModifyingLinkedFile {
	FailureDefinitionId^ get ();
}
static member ModifyingLinkedFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace